**free
ctl-opt dftactgrp(*no) option(*nodebugio) actgrp(*caller);
dcl-s str1 char(15) inz('Hello World');
dcl-s str2 char(15) inz('demowoLD');
dsply %lower(str1);
dsply %upper(str2);
*inlr = *on;


